---
kind: method
id: M:Autodesk.Revit.DB.DWGImportOptions.GetLineWeights
source: html/3247ccce-e7ad-6cdf-597a-5ebd13fa3f78.htm
---
# Autodesk.Revit.DB.DWGImportOptions.GetLineWeights Method

Gets array of line weights.

## Syntax (C#)
```csharp
public IList<int> GetLineWeights()
```